Autodesk.Revit.DB.DirectContext3D.VertexBuffer.GetMappedHandle
Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
Returns:
The handle to the mapped memory or nullptr when the buffer is not mapped.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.GetVertexStreamPositionNormalColored
Gets a stream that can be used to write vertices of type Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.GetVertexStreamPositionColored
Gets a stream that can be used to write vertices of type Autodesk.Revit.DB.DirectContext3D.VertexPositionColored into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.GetVertexStreamPositionNormal
Gets a stream that can be used to write vertices of type Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.GetVertexStreamPosition
Gets a stream that can be used to write vertices of type Autodesk.Revit.DB.DirectContext3D.VertexPosition into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.Unmap
Unmaps the buffer, so that it can be used for rendering.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This VertexBuffer is not available because Revit is not currently rendering. In general, this VertexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.Map(System.Int32)
Maps a portion of the buffer into memory, so that vertex data can be written into it.
(see Autodesk.Revit.DB.DirectContext3D.VertexStream).
sizeInFloats:
The size of the part of the buffer to be mapped, measured in floats.
Must be less than or equal to the size of the Autodesk.Revit.DB.DirectContext3D.VertexBuffer
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This VertexBuffer is not available because Revit is not currently rendering. In general, this VertexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
-or-
Thrown if the buffer is smaller than sizeInFloats.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.IsValid
Tests whether the buffer is valid for rendering.
Remarks:
The buffers are internally associated with low-level graphics state and may become invalidated when
the state changes. Therefore, an application should test each buffer for validity before submitting its
contents for rendering. If the buffer becomes invalid, the application should re-create its contents and
write them to a new buffer.
Returns:
True if the buffer is valid for rendering, false otherwise.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.#ctor(System.Int32)
Constructs the vertex buffer with the given capacity, measured in floats.
sizeInFloats:
The number of floats that the buffer can contain.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This VertexBuffer is not available because Revit is not currently rendering. In general, this VertexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer
A buffer that stores vertex data for rendering.
Since:
2017